In [1]:
import pandas as pd

In [2]:
data= pd.read_csv("Card_defaulter.csv")

In [3]:
data.head()

   Unnamed: 0 default student      balance       income
0           0      No      No   729.526495  44361.62507
1           1      No     Yes   817.180407  12106.13470
2           2      No      No  1073.549164  31767.13895
3           3      No      No   529.250605  35704.49394
4           4      No      No   785.655883  38463.49588

In [4]:
data= data.drop("Unnamed: 0", axis=1)

In [5]:
data.head()

  default student      balance       income
0      No      No   729.526495  44361.62507
1      No     Yes   817.180407  12106.13470
2      No      No  1073.549164  31767.13895
3      No      No   529.250605  35704.49394
4      No      No   785.655883  38463.49588

In [6]:
data["default"].value_counts()          #imbalance data

No     9667
Yes     333
Name: default, dtype: int64

# lets_do_LabelEncoder

In [7]:
from sklearn.preprocessing import LabelEncoder
k = LabelEncoder()
data["default"]= k.fit_transform(data["default"])

In [8]:
data.head()

   default student      balance       income
0        0      No   729.526495  44361.62507
1        0     Yes   817.180407  12106.13470
2        0      No  1073.549164  31767.13895
3        0      No   529.250605  35704.49394
4        0      No   785.655883  38463.49588

In [9]:
data["default"].value_counts()          #  inbalanced data   ,  0  is high  and 1 is less

0    9667
1     333
Name: default, dtype: int64

In [10]:
data["student"]= k.fit_transform(data["student"])

In [11]:
data.head()

   default  student      balance       income
0        0        0   729.526495  44361.62507
1        0        1   817.180407  12106.13470
2        0        0  1073.549164  31767.13895
3        0        0   529.250605  35704.49394
4        0        0   785.655883  38463.49588

In [12]:
data["student"].value_counts()

0    7056
1    2944
Name: student, dtype: int64

In [13]:
data1= data.query("default==0")

In [14]:
data2= data.query("default==1")

In [23]:
data1["default"].value_counts()

0    9667
Name: default, dtype: int64

In [25]:
data2["default"].value_counts()

1    333
Name: default, dtype: int64

In [27]:
data1_balance_mean= data1["balance"].mean()          #mean  for balance
data2_balance_mean= data2["balance"].mean()

In [28]:
data1_balance_mean

803.9437502338309

In [29]:
data2_balance_mean

1747.8216896066065

In [31]:
data1_balance_std= data1["balance"].std()             # std for balance
data2_balance_std= data2["balance"].std()

In [32]:
data1_balance_std

456.47623554566815

In [33]:
data2_balance_std

341.2668084437373

In [34]:
data1_income_mean= data["income"].mean()               # mean  for income
data2_income_mean= data["income"].mean()

In [40]:
data1_income_mean, data2_income_mean

(33516.98187595744, 33516.98187595744)

In [36]:
data1_income_std= data1["income"].std()
data2_income_std= data2["income"].std()               #  std for income

In [39]:
data1_income_std, data2_income_std

(13318.251248645513, 13804.22111038939)

In [41]:
data1.head()

   default  student      balance       income
0        0        0   729.526495  44361.62507
1        0        1   817.180407  12106.13470
2        0        0  1073.549164  31767.13895
3        0        0   529.250605  35704.49394
4        0        0   785.655883  38463.49588

In [44]:
data1["student"].value_counts()

0    6850
1    2817
Name: student, dtype: int64

In [49]:
data1_student_0= 6850/(6850+2817)
data1_student_1= 2817/(6850+2817)

In [50]:
data2["student"].value_counts()

0    206
1    127
Name: student, dtype: int64

In [51]:
data2_student_0= 206/(206+127)
data2_student_1= 127/(206+127)

In [60]:
import numpy as np
def f2(mean, std,x):
    z= (1/(2*3.14*(std**2))**.5) * np.exp(-(((x-mean)**2) / (2*std)))
    return z


f2(data1_balance_mean, data1_balance_std, 729.526495)

2.0285773343822733e-06

In [61]:
# 729.526495	44361.62507

In [71]:
f2(data2_income_mean, data2_income_std, 729.526495)           # because  data2  value count is very less

0.0

In [69]:
f2(data1_balance_mean, data1_balance_std, 729.526495)        # data1  value count is very high

2.0285773343822733e-06